# LightingFixtureLamp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LightingFixtureLamp Property
ParameterTypeId Class See Also
---
"Lamp"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LightingFixtureLamp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LightingFixtureLamp As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LightingFixtureLamp {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace